[
  "a",
  "A.M.",
  "abandon",
  "ability",
  "able",
  "abnormal",
  "aboard",
  "about",
  "above",
  "abroad",
  "absence",
  "absent",
  "absolute",
  "absorb",
  "abstract",
  "abuse",
  "academic",
  "academy",
  "accent",
  "accept",
  "acceptable",
  "acceptance",
  "accepted",
  "access",
  "accident",
  "accidental",
  "accommodate",
  "accommodation",
  "accompany",
  "accomplish",
  "accord",
  "account",
  "accountant",
  "accuracy",
  "accurate",
  "accuse",
  "ache",
  "achieve",
  "achievement",
  "acid",
  "acquaint",
  "acquaintance",
  "acquire",
  "acre",
  "across",
  "act",
  "action",
  "active",
  "activity",
  "actor",
  "actress",
  "actual",
  "actually",
  "adapt",
  "add",
  "addition",
  "additional",
  "address",
  "adequate",
  "adjective",
  "adjust",
  "administration",
  "admirable",
  "admiration",
  "admire",
  "admission",
  "admit",
  "adopt",
  "adult",
  "advance",
  "advanced",
  "advantage",
  "adventure",
  "advertise",
  "advertisement",
  "advice",
  "advise",
  "adviser",
  "affair",
  "affect",
  "LTTC",
  "affection",
  "afford",
  "afraid",
  "after",
  "afternoon",
  "afterward",
  "again",
  "against",
  "背景、襯托；防...、抗...初級",
  "age",
  "aged",
  "agency",
  "agent",
  "aggressive",
  "ago",
  "agree",
  "agreeable",
  "agreement",
  "agriculture",
  "ahead",
  "aid",
  "aim",
  "air",
  "air conditioner",
  "air-conditioned",
  "aircraft",
  "airline",
  "airmail",
  "airplane",
  "airport",
  "alarm",
  "album",
  "alcohol",
  "alcoholic",
  "alert",
  "alike",
  "alive",
  "all",
  "alley",
  "allow",
  "allowance",
  "almost",
  "alone",
  "along",
  "alongside",
  "aloud",
  "alphabet",
  "already",
  "also",
  "alternative",
  "although",
  "altitude",
  "altogether",
  "aluminium",
  "always",
  "am",
  "amateur",
  "amaze",
  "ambassador",
  "ambition",
  "ambitious",
  "ambulance",
  "America",
  "American",
  "amid",
  "among",
  "amount",
  "amuse",
  "amusement",
  "analysis",
  "analyst",
  "analyze",
  "ancestor",
  "ancient",
  "and",
  "angel",
  "anger",
  "angle",
  "angry",
  "animal",
  "ankle",
  "anniversary",
  "announce",
  "announcement",
  "announcer",
  "annoy",
  "annual",
  "another",
  "answer",
  "ant",
  "anxiety",
  "anxious",
  "any",
  "anybody",
  "anyhow",
  "anymore",
  "anyone",
  "anything",
  "anytime",
  "anyway",
  "anywhere",
  "apart",
  "apartment",
  "ape",
  "apologize",
  "apology",
  "app",
  "apparent",
  "appeal",
  "appear",
  "appearance",
  "appetite",
  "applaud",
  "applause",
  "apple",
  "appliance",
  "applicant",
  "application",
  "apply",
  "appoint",
  "appointment",
  "appreciate",
  "appreciation",
  "approach",
  "appropriate",
  "approval",
  "approve",
  "April",
  "apron",
  "aquarium",
  "arch",
  "architect",
  "architecture",
  "are",
  "area",
  "argue",
  "argument",
  "arise",
  "arithmetic",
  "arm",
  "armchair",
  "army",
  "around",
  "arouse",
  "arrange",
  "arrangement",
  "arrest",
  "arrival",
  "arrive",
  "arrow",
  "art",
  "article",
  "artificial",
  "artist",
  "artistic",
  "as",
  "ascend",
  "ash",
  "ashamed",
  "Asia",
  "Asian",
  "aside",
  "ask",
  "asleep",
  "aspect",
  "aspirin",
  "assassinate",
  "assemble",
  "assembly",
  "asset",
  "assign",
  "assist",
  "assistance",
  "assistant",
  "associate",
  "association",
  "assume",
  "assurance",
  "assure",
  "astonish",
  "astronaut",
  "at",
  "athlete",
  "athletic",
  "atmosphere",
  "atom",
  "atomic",
  "attach",
  "attack",
  "attempt",
  "attend",
  "attention",
  "attitude",
  "attract",
  "attraction",
  "attractive",
  "audience",
  "audio",
  "August",
  "aunt",
  "Australia",
  "author",
  "authority",
  "autobiography",
  "automatic",
  "automobile",
  "autumn",
  "auxiliary",
  "available",
  "avenue",
  "average",
  "avoid",
  "await",
  "awake",
  "awaken",
  "award",
  "aware",
  "away",
  "awful",
  "awkward",
  "ax",
  "baby",
  "babysit",
  "babysitter",
  "back",
  "background",
  "backward",
  "bacon",
  "bacteria",
  "bad",
  "badly",
  "badminton",
  "bag",
  "baggage",
  "baggy",
  "bait",
  "bake",
  "bakery",
  "balance",
  "balcony",
  "bald",
  "ball",
  "ballet",
  "balloon",
  "bamboo",
  "ban",
  "banana",
  "band",
  "bandage",
  "Band-Aid",
  "bang",
  "bank",
  "banker",
  "banking",
  "bankrupt",
  "bar",
  "barbecue",
  "barber",
  "barbershop",
  "bare",
  "barely",
  "bargain",
  "bark",
  "barn",
  "barrel",
  "barrier",
  "base",
  "baseball",
  "basement",
  "basic",
  "basin",
  "basis",
  "basket",
  "basketball",
  "bat",
  "bath",
  "bathe",
  "bathroom",
  "battery",
  "battle",
  "bay",
  "BC",
  "be",
  "beach",
  "bead",
  "beak",
  "beam",
  "bean",
  "bear",
  "beard",
  "beast",
  "beat",
  "beautiful",
  "beauty",
  "because",
  "become",
  "bed",
  "bedroom",
  "bedtime",
  "bee",
  "beef",
  "beer",
  "beetle",
  "before",
  "beg",
  "beggar",
  "begin",
  "beginner",
  "beginning",
  "behave",
  "behavior",
  "behind",
  "being",
  "belief",
  "believable",
  "believe",
  "bell",
  "belly",
  "belong",
  "below",
  "belt",
  "bench",
  "bend",
  "beneath",
  "beneficial",
  "benefit",
  "berry",
  "beside",
  "besides",
  "best",
  "bet",
  "better",
  "between",
  "beyond",
  "Bible",
  "bicycle",
  "bid",
  "big",
  "bill",
  "billion",
  "bin",
  "bind",
  "bingo",
  "biography",
  "biology",
  "bird",
  "birth",
  "birthday",
  "biscuit",
  "bit",
  "bite",
  "bitter",
  "black",
  "blackboard",
  "blame",
  "blank",
  "blanket",
  "bleed",
  "blend",
  "bless",
  "blessing",
  "blind",
  "blink",
  "block",
  "blonde",
  "blood",
  "bloody",
  "bloom",
  "blossom",
  "blouse",
  "blow",
  "blue",
  "blush",
  "board",
  "boast",
  "boat",
  "body",
  "boil",
  "bold",
  "bomb",
  "bond",
  "bone",
  "bony",
  "book",
  "bookcase",
  "booking",
  "booklet",
  "bookshelf",
  "bookstore",
  "boot",
  "border",
  "bore",
  "bored",
  "boring",
  "born",
  "borrow",
  "boss",
  "both",
  "bother",
  "bottle",
  "bottom",
  "bounce",
  "bow",
  "bowl",
  "bowling",
  "box",
  "boy",
  "boycott",
  "boyfriend",
  "bra",
  "bracelet",
  "brain",
  "brake",
  "branch",
  "brand",
  "brand-new",
  "brass",
  "brave",
  "bravery",
  "bread",
  "break",
  "breakfast",
  "breast",
  "breath",
  "breathe",
  "breed",
  "breeze",
  "bribe",
  "brick",
  "bride",
  "bridegroom",
  "bridge",
  "brief",
  "briefcase",
  "bright",
  "brilliant",
  "bring",
  "Britain",
  "broad",
  "broadcast",
  "broke",
  "brook",
  "broom",
  "brother",
  "brown",
  "brownie",
  "browse",
  "brunch",
  "brush",
  "brutal",
  "bubble",
  "bucket",
  "bud",
  "budget",
  "buffalo",
  "buffet",
  "bug",
  "build",
  "building",
  "bull",
  "bullet",
  "bulletin",
  "bump",
  "bun",
  "bunch",
  "bundle",
  "burden",
  "bureau",
  "burglar",
  "burn",
  "burst",
  "bury",
  "bus",
  "bush",
  "business",
  "businessperson",
  "busy",
  "but",
  "butcher",
  "butter",
  "butterfly",
  "button",
  "buy",
  "buzz",
  "by",
  "cabbage",
  "cabin",
  "cabinet",
  "cable",
  "cafe",
  "cafeteria",
  "cage",
  "cake",
  "calculate",
  "calculator",
  "calendar",
  "call",
  "calm",
  "camel",
  "camera",
  "camp",
  "campaign",
  "campus",
  "can",
  "Canada",
  "canal",
  "cancel",
  "cancer",
  "candidate",
  "candle",
  "candy",
  "cane",
  "canoe",
  "canvas",
  "canyon",
  "cap",
  "capable",
  "capacity",
  "cape",
  "capital",
  "capitalism",
  "capitalist",
  "captain",
  "caption",
  "capture",
  "car",
  "carbon",
  "card",
  "care",
  "career",
  "careful",
  "careless",
  "cargo",
  "carpenter",
  "carpet",
  "carriage",
  "carrot",
  "carry",
  "cart",
  "cartoon",
  "carve",
  "case",
  "cash",
  "cashier",
  "cast",
  "castle",
  "casual",
  "casualty",
  "cat",
  "catalog",
  "catch",
  "caterpillar",
  "cattle",
  "cause",
  "cave",
  "CD",
  "cease",
  "ceiling",
  "celebrate",
  "celebration",
  "cell",
  "cellphone",
  "cement",
  "cent",
  "center",
  "centimeter",
  "central",
  "century",
  "cereal",
  "ceremony",
  "certain",
  "certainly",
  "certificate",
  "chain",
  "chair",
  "chairperson",
  "chalk",
  "challenge",
  "chamber",
  "champion",
  "championship",
  "chance",
  "change",
  "changeable",
  "channel",
  "chapter",
  "character",
  "characteristic",
  "charge",
  "charity",
  "charm",
  "chart",
  "chase",
  "chat",
  "cheap",
  "cheat",
  "check",
  "check-in",
  "checkout",
  "cheek",
  "cheer",
  "cheerful",
  "cheese",
  "chemical",
  "chemist",
  "chemistry",
  "cherish",
  "cherry",
  "chess",
  "chest",
  "chew",
  "chick",
  "chicken",
  "chief",
  "child",
  "childbirth",
  "childhood",
  "childish",
  "childlike",
  "chill",
  "chilly",
  "chimney",
  "chin",
  "China",
  "china",
  "Chinese",
  "chip",
  "(杯碟的)缺口中級",
  "chocolate",
  "choice",
  "choke",
  "choose",
  "chop",
  "chopstick",
  "chore",
  "chorus",
  "Christian",
  "Christmas",
  "chubby",
  "church",
  "cigar",
  "cigarette",
  "cinema",
  "circle",
  "circular",
  "circulate",
  "circulation",
  "circumstance",
  "circus",
  "citizen",
  "city",
  "civil",
  "civilian",
  "civilization",
  "civilize",
  "claim",
  "clap",
  "clarify",
  "clash",
  "class",
  "classic",
  "classical",
  "classification",
  "classify",
  "classmate",
  "classroom",
  "claw",
  "clay",
  "clean",
  "cleaner",
  "clear",
  "clerk",
  "clever",
  "click",
  "client",
  "cliff",
  "climate",
  "climax",
  "climb",
  "climber",
  "clinic",
  "clip",
  "clock",
  "close",
  "closet",
  "cloth",
  "clothe",
  "clothes",
  "clothing",
  "cloud",
  "cloudy",
  "clown",
  "club",
  "clue",
  "clumsy",
  "coach",
  "coal",
  "coarse",
  "coast",
  "coat",
  "cock",
  "cockroach",
  "cocktail",
  "cocoa",
  "coconut",
  "code",
  "coffee",
  "coin",
  "coincidence",
  "Coke",
  "cola",
  "cold",
  "collapse",
  "collar",
  "colleague",
  "collect",
  "collection",
  "college",
  "colony",
  "color",
  "colored",
  "colorful",
  "column",
  "comb",
  "combination",
  "combine",
  "come",
  "comedian",
  "comedy",
  "comfort",
  "comfortable",
  "comic",
  "coming",
  "command",
  "commander",
  "comment",
  "commerce",
  "commercial",
  "commission",
  "commit",
  "commitment",
  "committee",
  "common",
  "communicate",
  "communication",
  "communist",
  "community",
  "companion",
  "company",
  "comparative",
  "compare",
  "comparison",
  "compete",
  "competition",
  "competitive",
  "competitor",
  "complain",
  "complaint",
  "complete",
  "complex",
  "complicate",
  "compliment",
  "compose",
  "composer",
  "composition",
  "compound",
  "comprehension",
  "compute",
  "computer",
  "conceal",
  "concentrate",
  "concentration",
  "concept",
  "concern",
  "concerning",
  "concert",
  "conclude",
  "conclusion",
  "concrete",
  "condition",
  "conduct",
  "conductor",
  "cone",
  "conference",
  "confess",
  "confidence",
  "confident",
  "confine",
  "confirm",
  "conflict",
  "confront",
  "confrontation",
  "Confucius",
  "confuse",
  "confusion",
  "congratulate",
  "congratulation",
  "congress",
  "conjunction",
  "connect",
  "connection",
  "conquer",
  "conscience",
  "conscious",
  "consequence",
  "consequent",
  "conservative",
  "consider",
  "considerable",
  "considerate",
  "consideration",
  "consist",
  "consistent",
  "consonant",
  "constant",
  "constitute",
  "constitution",
  "construct",
  "construction",
  "constructive",
  "consult",
  "consultant",
  "consume",
  "consumer",
  "contact",
  "contact lens",
  "contain",
  "container",
  "contemporary",
  "content",
  "contest",
  "context",
  "continent",
  "continental",
  "continual",
  "continue",
  "continuous",
  "contract",
  "contrary",
  "contrast",
  "contribute",
  "contribution",
  "control",
  "convenience",
  "convenience store",
  "convenient",
  "convention",
  "conventional",
  "conversation",
  "converse",
  "convey",
  "convince",
  "cook",
  "cooker",
  "cookie",
  "cool",
  "cooperate",
  "cooperation",
  "cooperative",
  "cope",
  "copper",
  "copy",
  "cord",
  "corn",
  "corner",
  "corporation",
  "correct",
  "correspond",
  "correspondent",
  "corridor",
  "cost",
  "costly",
  "costume",
  "cottage",
  "cotton",
  "couch",
  "cough",
  "could",
  "council",
  "count",
  "counter",
  "country",
  "countryside",
  "county",
  "couple",
  "courage",
  "courageous",
  "course",
  "court",
  "courteous",
  "courtesy",
  "cousin",
  "cover",
  "cow",
  "coward",
  "cowboy",
  "crab",
  "crack",
  "cradle",
  "craft",
  "cram",
  "crane",
  "crash",
  "crawl",
  "crayon",
  "crazy",
  "cream",
  "create",
  "creation",
  "creative",
  "creator",
  "creature",
  "credit",
  "credit card",
  "creep",
  "crew",
  "cricket",
  "crime",
  "criminal",
  "cripple",
  "crisis",
  "crisp",
  "crispy",
  "critic",
  "critical",
  "criticism",
  "criticize",
  "crop",
  "cross",
  "crossroad",
  "crow",
  "crowd",
  "crowded",
  "crown",
  "cruel",
  "cruelty",
  "crush",
  "crutch",
  "cry",
  "crystal",
  "cub",
  "cucumber",
  "cue",
  "cultivate",
  "cultural",
  "culture",
  "cunning",
  "cup",
  "cupboard",
  "cure",
  "curiosity",
  "curious",
  "curl",
  "current",
  "curse",
  "curtain",
  "curve",
  "cushion",
  "custom",
  "customer",
  "customs",
  "cut",
  "cute",
  "cycle",
  "cyclist",
  "dad",
  "daily",
  "dairy",
  "dam",
  "damage",
  "damn",
  "damp",
  "dance",
  "dancer",
  "danger",
  "dangerous",
  "dare",
  "dark",
  "darling",
  "dash",
  "data",
  "date",
  "daughter",
  "dawn",
  "day",
  "daylight",
  "dead",
  "deadline",
  "deaf",
  "deal",
  "dear",
  "death",
  "debate",
  "debt",
  "decade",
  "decay",
  "deceive",
  "December",
  "decide",
  "decision",
  "deck",
  "declaration",
  "declare",
  "decline",
  "decorate",
  "decoration",
  "decrease",
  "deed",
  "deep",
  "deer",
  "defeat",
  "defend",
  "defense",
  "defensive",
  "deficit",
  "define",
  "definite",
  "definition",
  "degree",
  "delay",
  "delegate",
  "delete",
  "delicate",
  "delicious",
  "delight",
  "delightful",
  "deliver",
  "delivery",
  "demand",
  "demanding",
  "democracy",
  "democrat",
  "democratic",
  "demonstrate",
  "demonstration",
  "dense",
  "dentist",
  "deny",
  "depart",
  "department",
  "department store",
  "departure",
  "depend",
  "dependable",
  "dependent",
  "deposit",
  "depress",
  "depression",
  "depth",
  "deputy",
  "describe",
  "description",
  "desert",
  "deserve",
  "design",
  "designer",
  "desirable",
  "desire",
  "desk",
  "despair",
  "desperate",
  "despite",
  "dessert",
  "destination",
  "destroy",
  "destruction",
  "destructive",
  "detail",
  "detailed",
  "detect",
  "detective",
  "detergent",
  "determination",
  "determine",
  "develop",
  "development",
  "device",
  "devil",
  "devise",
  "devote",
  "devoted",
  "devotion",
  "dial",
  "dialect",
  "dialog",
  "diamond",
  "diary",
  "dictate",
  "dictation",
  "dictionary",
  "die",
  "diet",
  "differ",
  "difference",
  "different",
  "difficult",
  "difficulty",
  "dig",
  "digest",
  "digestion",
  "digit",
  "digital",
  "dignity",
  "diligence",
  "diligent",
  "dim",
  "dime",
  "dine",
  "dining room",
  "dinner",
  "dinosaur",
  "dip",
  "diploma",
  "diplomat",
  "direct",
  "direction",
  "director",
  "dirt",
  "dirty",
  "disabled",
  "disadvantage",
  "disadvantaged",
  "disagree",
  "disappear",
  "disappoint",
  "disappointment",
  "disapproval",
  "disapprove",
  "disaster",
  "discard",
  "discipline",
  "disconnect",
  "discount",
  "discourage",
  "discover",
  "discovery",
  "discuss",
  "discussion",
  "disease",
  "disguise",
  "disgust",
  "dish",
  "dishonest",
  "disk",
  "dislike",
  "dismiss",
  "disorder",
  "display",
  "dispute",
  "dissatisfaction",
  "dissolve",
  "distance",
  "distant",
  "distinct",
  "distinction",
  "distinguish",
  "distinguished",
  "distribute",
  "distribution",
  "district",
  "distrust",
  "disturb",
  "disturbance",
  "ditch",
  "dive",
  "divide",
  "divine",
  "division",
  "divorce",
  "dizzy",
  "do",
  "dock",
  "doctor",
  "document",
  "dodge ball",
  "dog",
  "doll",
  "dollar",
  "dolphin",
  "domestic",
  "dominant",
  "dominate",
  "donate",
  "donkey",
  "door",
  "dormitory",
  "dose",
  "dot",
  "double",
  "Double Tenth Day",
  "doubt",
  "doubtful",
  "doughnut",
  "dove",
  "down",
  "download",
  "downstairs",
  "downtown",
  "downward",
  "doze",
  "dozen",
  "draft",
  "drag",
  "dragon",
  "Dragon Boat Festival",
  "dragonfly",
  "drain",
  "drama",
  "dramatic",
  "draw",
  "drawer",
  "dread",
  "dreadful",
  "dream",
  "dress",
  "dressed",
  "dresser",
  "drift",
  "drill",
  "drink",
  "drip",
  "drive",
  "driver",
  "drop",
  "drought",
  "drown",
  "drowsy",
  "drug",
  "drugstore",
  "drum",
  "drunk",
  "dry",
  "dryer",
  "duck",
  "duckling",
  "due",
  "dull",
  "dumb",
  "dump",
  "dumpling",
  "durable",
  "duration",
  "during",
  "dusk",
  "dust",
  "dusty",
  "duty",
  "dye",
  "dynamic",
  "dynasty",
  "each",
  "eager",
  "eagle",
  "ear",
  "early",
  "earn",
  "earnest",
  "earnings",
  "earring",
  "earth",
  "earthquake",
  "ease",
  "east",
  "Easter",
  "eastern",
  "easy",
  "eat",
  "echo",
  "economic",
  "economical",
  "economics",
  "economist",
  "economy",
  "edge",
  "edible",
  "edit",
  "edition",
  "editor",
  "editorial",
  "educate",
  "education",
  "educational",
  "effect",
  "effective",
  "efficiency",
  "efficient",
  "effort",
  "egg",
  "eight",
  "eighteen",
  "eighty",
  "either",
  "elaborate",
  "elastic",
  "elbow",
  "elder",
  "elderly",
  "elect",
  "election",
  "electric",
  "electrical",
  "electrician",
  "electricity",
  "electronic",
  "electronics",
  "elegant",
  "element",
  "elementary",
  "elementary school",
  "elephant",
  "elevator",
  "eleven",
  "eliminate",
  "else",
  "elsewhere",
  "email",
  "embarrass",
  "embassy",
  "emerge",
  "emergency",
  "emotion",
  "emotional",
  "emperor",
  "emphasis",
  "emphasize",
  "empire",
  "employ",
  "employee",
  "employer",
  "employment",
  "empty",
  "enable",
  "enclose",
  "encounter",
  "encourage",
  "encouragement",
  "end",
  "endanger",
  "ending",
  "endurance",
  "endure",
  "enemy",
  "energetic",
  "energy",
  "enforce",
  "engage",
  "engine",
  "engineer",
  "engineering",
  "England",
  "English",
  "enhance",
  "enjoy",
  "enjoyable",
  "enjoyment",
  "enlarge",
  "enlargement",
  "enormous",
  "enough",
  "enroll",
  "ensure",
  "enter",
  "enterprise",
  "entertain",
  "entertainer",
  "entertainment",
  "enthusiasm",
  "enthusiastic",
  "entire",
  "entitle",
  "entrance",
  "entry",
  "envelope",
  "envious",
  "environment",
  "environmental",
  "envy",
  "equal",
  "equality",
  "equip",
  "equipment",
  "equivalent",
  "era",
  "erase",
  "eraser",
  "erect",
  "errand",
  "error",
  "escalator",
  "escape",
  "especially",
  "essay",
  "essential",
  "essentially",
  "establish",
  "estate",
  "estimate",
  "etc.",
  "Europe",
  "European",
  "evaluate",
  "eve",
  "even",
  "evening",
  "event",
  "eventual",
  "ever",
  "every",
  "everybody",
  "everyday",
  "everyone",
  "everything",
  "everywhere",
  "evidence",
  "evident",
  "evil",
  "evolution",
  "evolve",
  "exact",
  "exactly",
  "exaggerate",
  "exam",
  "examination",
  "examine",
  "examiner",
  "example",
  "excellence",
  "excellent",
  "except",
  "exception",
  "exceptional",
  "exchange",
  "excite",
  "excitement",
  "exclaim",
  "excursion",
  "excuse",
  "executive",
  "exercise",
  "exhaust",
  "exhibit",
  "exhibition",
  "exist",
  "existence",
  "exit",
  "expand",
  "expansion",
  "expect",
  "expectation",
  "expense",
  "expensive",
  "experience",
  "experiment",
  "experimental",
  "expert",
  "explain",
  "explanation",
  "explode",
  "exploit",
  "explore",
  "explorer",
  "explosion",
  "explosive",
  "export",
  "expose",
  "exposure",
  "express",
  "expression",
  "extend",
  "extension",
  "extensive",
  "extent",
  "extinct",
  "extra",
  "extraordinary",
  "extreme",
  "eye",
  "eyebrow",
  "eyesight",
  "fable",
  "face",
  "facial",
  "facility",
  "fact",
  "factor",
  "factory",
  "fade",
  "fail",
  "failure",
  "faint",
  "fair",
  "fairly",
  "fairy",
  "faith",
  "faithful",
  "fake",
  "fall",
  "false",
  "fame",
  "familiar",
  "family",
  "famous",
  "fan",
  "fancy",
  "fantastic",
  "fantasy",
  "far",
  "fare",
  "farewell",
  "farm",
  "farmer",
  "farming",
  "fascinate",
  "fashion",
  "fashionable",
  "fast",
  "fasten",
  "fat",
  "fatal",
  "fate",
  "father",
  "faucet",
  "fault",
  "faulty",
  "favor",
  "favorable",
  "favorite",
  "fax",
  "fear",
  "feast",
  "feather",
  "feature",
  "February",
  "federal",
  "fee",
  "feed",
  "feedback",
  "feel",
  "feeling",
  "fellow",
  "female",
  "fence",
  "ferry",
  "fertile",
  "fertilizer",
  "festival",
  "fetch",
  "fever",
  "few",
  "fiction",
  "field",
  "fierce",
  "fifteen",
  "fifty",
  "fight",
  "fighter",
  "figure",
  "file",
  "fill",
  "film",
  "final",
  "finance",
  "financial",
  "find",
  "fine",
  "finger",
  "finish",
  "fire",
  "fireplace",
  "firework",
  "firm",
  "first",
  "fish",
  "fisherman",
  "fist",
  "fit",
  "five",
  "fix",
  "flag",
  "flame",
  "flash",
  "flashlight",
  "flat",
  "flat tire",
  "flatter",
  "flavor",
  "flea",
  "flee",
  "flesh",
  "flexible",
  "flight",
  "float",
  "flock",
  "flood",
  "flooding",
  "floor",
  "flour",
  "flow",
  "flower",
  "flu",
  "fluent",
  "flush",
  "flute",
  "fly",
  "foam",
  "focus",
  "fog",
  "foggy",
  "fold",
  "folk",
  "follow",
  "follower",
  "following",
  "fond",
  "food",
  "fool",
  "foolish",
  "foot",
  "football",
  "for",
  "forbid",
  "force",
  "forecast",
  "forehead",
  "foreign",
  "foreigner",
  "foresee",
  "forest",
  "forever",
  "forget",
  "forgetful",
  "forgive",
  "fork",
  "form",
  "formal",
  "formation",
  "former",
  "formula",
  "fort",
  "forth",
  "fortunate",
  "fortune",
  "forty",
  "forward",
  "found",
  "foundation",
  "founder",
  "fountain",
  "four",
  "fourteen",
  "fox",
  "fragrance",
  "frame",
  "France",
  "frank",
  "free",
  "freedom",
  "freeway",
  "freeze",
  "freezer",
  "freezing",
  "French fries",
  "frequency",
  "frequent",
  "fresh",
  "freshman",
  "Friday",
  "fridge",
  "friend",
  "friendly",
  "friendship",
  "fright",
  "frighten",
  "frisbee",
  "frog",
  "from",
  "front",
  "frost",
  "frosty",
  "frown",
  "frozen",
  "fruit",
  "frustrate",
  "fry",
  "fuel",
  "fulfill",
  "full",
  "full-time",
  "fully",
  "fun",
  "function",
  "functional",
  "fund",
  "fundamental",
  "funeral",
  "funny",
  "fur",
  "furious",
  "furnish",
  "furniture",
  "further",
  "furthermore",
  "future",
  "gain",
  "gallery",
  "gallon",
  "gamble",
  "gambler",
  "game",
  "gang",
  "gangster",
  "gap",
  "garage",
  "garbage",
  "garden",
  "gardener",
  "garlic",
  "gas",
  "gasoline",
  "gate",
  "gather",
  "gay",
  "gaze",
  "gear",
  "gene",
  "general",
  "generation",
  "generosity",
  "generous",
  "genius",
  "gentle",
  "gentleman",
  "genuine",
  "geography",
  "germ",
  "Germany",
  "gesture",
  "get",
  "ghost",
  "giant",
  "gift",
  "gifted",
  "gigantic",
  "giggle",
  "ginger",
  "giraffe",
  "girl",
  "girlfriend",
  "give",
  "glad",
  "glance",
  "glass",
  "glasses",
  "glide",
  "glimpse",
  "global",
  "globe",
  "glorious",
  "glory",
  "glove",
  "glow",
  "glue",
  "go",
  "goal",
  "goat",
  "God",
  "goddess",
  "gold",
  "golden",
  "golf",
  "good",
  "goodbye",
  "good-looking",
  "goodness",
  "goods",
  "goose",
  "gossip",
  "govern",
  "government",
  "governor",
  "gown",
  "grab",
  "grace",
  "graceful",
  "gracious",
  "grade",
  "gradual",
  "graduate",
  "graduation",
  "grain",
  "gram",
  "grammar",
  "grand",
  "grandchild",
  "granddaughter",
  "grandfather",
  "grandmother",
  "grandparent",
  "grandson",
  "grant",
  "grape",
  "grapefruit",
  "grasp",
  "grass",
  "grateful",
  "gratitude",
  "grave",
  "gravity",
  "gray",
  "greasy",
  "great",
  "greatly",
  "greedy",
  "green",
  "greenhouse",
  "greet",
  "greeting",
  "grief",
  "grieve",
  "grin",
  "grind",
  "grocery",
  "ground",
  "group",
  "grow",
  "grown-up",
  "growth",
  "guarantee",
  "guard",
  "guardian",
  "guava",
  "guess",
  "guest",
  "guidance",
  "guide",
  "guilt",
  "guilty",
  "guitar",
  "gulf",
  "gum",
  "gun",
  "guy",
  "gym",
  "habit",
  "habitual",
  "hair",
  "haircut",
  "hairdresser",
  "half",
  "halfway",
  "hall",
  "Halloween",
  "hallway",
  "halt",
  "ham",
  "hamburger",
  "hammer",
  "hand",
  "handbag",
  "handful",
  "handicap",
  "handkerchief",
  "handle",
  "handsome",
  "handwriting",
  "handy",
  "hang",
  "hanger",
  "happen",
  "happy",
  "harbor",
  "hard",
  "harden",
  "hardly",
  "hardship",
  "hardware",
  "hardworking",
  "harm",
  "harmful",
  "harmony",
  "harsh",
  "harvest",
  "hassle",
  "hasty",
  "hat",
  "hatch",
  "hate",
  "hatred",
  "have",
  "hawk",
  "hay",
  "he",
  "head",
  "headache",
  "headline",
  "headmaster",
  "headphones",
  "headquarters",
  "headsets",
  "heal",
  "health",
  "healthy",
  "heap",
  "hear",
  "heart",
  "heartbreak",
  "heat",
  "heater",
  "heaven",
  "heavenly",
  "heavy",
  "heel",
  "height",
  "helicopter",
  "hell",
  "hello",
  "helmet",
  "help",
  "helpful",
  "hen",
  "hence",
  "her",
  "herd",
  "here",
  "hero",
  "heroine",
  "hers",
  "herself",
  "hesitate",
  "hesitation",
  "hey",
  "hi",
  "hidden",
  "hide",
  "high",
  "highly",
  "high-rise",
  "highway",
  "hijack",
  "hijacker",
  "hike",
  "hiker",
  "hill",
  "him",
  "himself",
  "hint",
  "hip",
  "hippopotamus",
  "hire",
  "his",
  "historian",
  "historic",
  "historical",
  "history",
  "hit",
  "hive",
  "hobby",
  "hold",
  "hole",
  "holiday",
  "hollow",
  "holy",
  "home",
  "homeland",
  "homesick",
  "hometown",
  "homework",
  "honest",
  "honestly",
  "honesty",
  "honey",
  "honeymoon",
  "Hong Kong",
  "honor",
  "honorable",
  "hook",
  "hop",
  "hope",
  "hopeful",
  "hopefully",
  "horizon",
  "horn",
  "horrible",
  "horrify",
  "horror",
  "horse",
  "hose",
  "hospital",
  "host",
  "hostage",
  "hostel",
  "hostess",
  "hot",
  "hot dog",
  "hotel",
  "hour",
  "hourly",
  "house",
  "household",
  "housekeeper",
  "housewife",
  "housework",
  "housing",
  "how",
  "however",
  "Hualian",
  "hug",
  "huge",
  "hum",
  "human",
  "humanity",
  "humble",
  "humid",
  "humidity",
  "humor",
  "humorous",
  "hundred",
  "hunger",
  "hungry",
  "hunt",
  "hunter",
  "hurricane",
  "hurry",
  "hurt",
  "husband",
  "hush",
  "hut",
  "hydrogen",
  "I",
  "ice",
  "ice cream",
  "iceberg",
  "icy",
  "idea",
  "ideal",
  "identical",
  "identification",
  "identify",
  "identity",
  "idiom",
  "idle",
  "idol",
  "if",
  "ignorance",
  "ignorant",
  "ignore",
  "ill",
  "illness",
  "illustrate",
  "illustration",
  "image",
  "imaginable",
  "imaginary",
  "imagination",
  "imaginative",
  "imagine",
  "imitate",
  "imitation",
  "immediate",
  "immediately",
  "immigrant",
  "immigration",
  "impact",
  "imperial",
  "impersonal",
  "implement",
  "implication",
  "imply",
  "import",
  "importance",
  "important",
  "impose",
  "impress",
  "impression",
  "impressive",
  "improve",
  "improvement",
  "in",
  "inch",
  "incident",
  "include",
  "including",
  "income",
  "increase",
  "increasingly",
  "incredible",
  "indeed",
  "independence",
  "independent",
  "India",
  "indicate",
  "indication",
  "individual",
  "indoor",
  "indoors",
  "industrial",
  "industrialize",
  "industry",
  "inevitable",
  "infant",
  "infect",
  "infection",
  "infer",
  "inference",
  "inferior",
  "inflation",
  "influence",
  "influential",
  "inform",
  "informal",
  "information",
  "informative",
  "informed",
  "ingredient",
  "inhabitant",
  "inherit",
  "initial",
  "inject",
  "injection",
  "injure",
  "injury",
  "ink",
  "inn",
  "inner",
  "innocence",
  "innocent",
  "input",
  "inquire",
  "inquiry",
  "insect",
  "insert",
  "inside",
  "insist",
  "inspect",
  "inspector",
  "inspiration",
  "inspire",
  "install",
  "instance",
  "instant",
  "instead",
  "instinct",
  "institute",
  "institution",
  "instruct",
  "instruction",
  "instructor",
  "instrument",
  "insult",
  "insurance",
  "intellectual",
  "intelligence",
  "intelligent",
  "intend",
  "intense",
  "intensify",
  "intensive",
  "intention",
  "interact",
  "interest",
  "interfere",
  "interference",
  "intermediate",
  "internal",
  "international",
  "Internet",
  "interpret",
  "interpretation",
  "interpreter",
  "interrupt",
  "interval",
  "interview",
  "intimate",
  "into",
  "introduce",
  "introduction",
  "intrude",
  "intruder",
  "invade",
  "invent",
  "invention",
  "inventor",
  "invest",
  "investigate",
  "investment",
  "investor",
  "invisible",
  "invitation",
  "invite",
  "involve",
  "iron",
  "is",
  "island",
  "isolate",
  "isolation",
  "issue",
  "it",
  "itch",
  "item",
  "its",
  "itself",
  "ivory",
  "jacket",
  "jail",
  "jam",
  "January",
  "Japan",
  "Japanese",
  "jar",
  "jaw",
  "jazz",
  "jealous",
  "jealousy",
  "jeans",
  "jeep",
  "jelly",
  "jet",
  "jewel",
  "jewellery",
  "job",
  "jog",
  "join",
  "joint",
  "joke",
  "journal",
  "journalist",
  "journey",
  "joy",
  "joyful",
  "judge",
  "judgment",
  "juice",
  "juicy",
  "July",
  "jump",
  "June",
  "jungle",
  "junior",
  "（四年制中學或大學的）三年級學生中級",
  "junior high school",
  "junk",
  "jury",
  "just",
  "justice",
  "kangaroo",
  "Kaohsiung",
  "keen",
  "keep",
  "keeper",
  "ketchup",
  "kettle",
  "key",
  "keyboard",
  "kick",
  "kid",
  "kidnap",
  "kidney",
  "kill",
  "kilogram",
  "kilometer",
  "kind",
  "kindergarten",
  "kindly",
  "kindness",
  "king",
  "kingdom",
  "kiss",
  "kit",
  "kitchen",
  "kite",
  "kitten",
  "knee",
  "kneel",
  "knife",
  "knight",
  "knit",
  "knob",
  "knock",
  "knot",
  "know",
  "knowledge",
  "knowledgeable",
  "koala",
  "Korea",
  "Korean",
  "KTV",
  "label",
  "labor",
  "laboratory",
  "lace",
  "lack",
  "ladder",
  "lady",
  "ladybug",
  "lag",
  "lake",
  "lamb",
  "lamp",
  "land",
  "landlady",
  "landlord",
  "landmark",
  "landscape",
  "landslide",
  "lane",
  "language",
  "lantern",
  "Lantern Festival",
  "lap",
  "large",
  "largely",
  "laser",
  "last",
  "late",
  "lately",
  "later",
  "latest",
  "latitude",
  "latter",
  "laugh",
  "laughter",
  "launch",
  "laundry",
  "lavatory",
  "law",
  "lawful",
  "lawn",
  "lawyer",
  "lay",
  "layer",
  "lazy",
  "lead",
  "leader",
  "leadership",
  "leading",
  "leaf",
  "leaflet",
  "league",
  "leak",
  "lean",
  "leap",
  "learn",
  "learned",
  "learner",
  "learning",
  "least",
  "leather",
  "leave",
  "lecture",
  "lecturer",
  "left",
  "left-hand",
  "leg",
  "legal",
  "legend",
  "legendary",
  "leisure",
  "leisurely",
  "lemon",
  "lemonade",
  "lend",
  "length",
  "lengthen",
  "lens",
  "leopard",
  "less",
  "lesson",
  "let",
  "letter",
  "lettuce",
  "level",
  "liar",
  "liberal",
  "liberate",
  "liberty",
  "librarian",
  "library",
  "license",
  "lick",
  "lid",
  "lie",
  "life",
  "lifestyle",
  "lifetime",
  "lift",
  "light",
  "lighten",
  "lighthouse",
  "lightning",
  "like",
  "likely",
  "lily",
  "limb",
  "limit",
  "limitation",
  "line",
  "linen",
  "link",
  "lion",
  "lip",
  "lipstick",
  "liquid",
  "liquor",
  "list",
  "listen",
  "listener",
  "liter",
  "literary",
  "literature",
  "litter",
  "little",
  "live",
  "lively",
  "liver",
  "living room",
  "load",
  "loaf",
  "loan",
  "lobby",
  "lobster",
  "local",
  "locate",
  "location",
  "lock",
  "locker",
  "log",
  "logic",
  "logical",
  "loneliness",
  "lonely",
  "long",
  "long-standing",
  "long-term",
  "look",
  "loop",
  "loose",
  "loosen",
  "lord",
  "lorry",
  "lose",
  "loser",
  "loss",
  "lot",
  "lotion",
  "loud",
  "loudspeaker",
  "lousy",
  "love",
  "lovely",
  "lover",
  "low",
  "lower",
  "loyal",
  "loyalty",
  "luck",
  "lucky",
  "luggage",
  "lullaby",
  "lunar",
  "lunch",
  "lung",
  "luxurious",
  "luxury",
  "lychee",
  "ma'am",
  "machine",
  "machinery",
  "mad",
  "madam",
  "magazine",
  "magic",
  "magical",
  "magician",
  "magnet",
  "magnetic",
  "magnificent",
  "maid",
  "mail",
  "mail carrier",
  "main",
  "mainland",
  "maintain",
  "major",
  "majority",
  "make",
  "maker",
  "makeup",
  "male",
  "mall",
  "man",
  "manage",
  "manageable",
  "management",
  "manager",
  "Mandarin",
  "mango",
  "mankind",
  "man-made",
  "manner",
  "mansion",
  "manual",
  "manufacture",
  "manufacturer",
  "many",
  "map",
  "marathon",
  "marble",
  "march",
  "March",
  "margin",
  "mark",
  "marker",
  "market",
  "marriage",
  "marry",
  "marvelous",
  "mask",
  "mass",
  "master",
  "masterpiece",
  "mat",
  "match",
  "mate",
  "material",
  "math",
  "mathematical",
  "matter",
  "mature",
  "maturity",
  "maximum",
  "may",
  "May",
  "maybe",
  "mayor",
  "me",
  "meadow",
  "meal",
  "mean",
  "meaning",
  "meaningful",
  "means",
  "meantime",
  "meanwhile",
  "measurable",
  "measure",
  "meat",
  "mechanic",
  "mechanical",
  "medal",
  "media",
  "medical",
  "medicine",
  "medium",
  "meet",
  "meeting",
  "melody",
  "melon",
  "melt",
  "member",
  "membership",
  "memorable",
  "memorandum",
  "memorial",
  "memorize",
  "memory",
  "mend",
  "men's room",
  "mental",
  "mention",
  "menu",
  "merchant",
  "mercy",
  "mere",
  "merit",
  "merry",
  "mess",
  "message",
  "messenger",
  "messy",
  "metal",
  "meter",
  "method",
  "metro",
  "microphone",
  "microscope",
  "microwave",
  "midday",
  "middle",
  "middle-aged",
  "midnight",
  "might",
  "mighty",
  "mild",
  "mile",
  "military",
  "milk",
  "milkshake",
  "mill",
  "million",
  "mind",
  "mine",
  "miner",
  "mineral",
  "minimum",
  "minister",
  "ministry",
  "minor",
  "minority",
  "minus",
  "minute",
  "miracle",
  "mirror",
  "mischief",
  "miserable",
  "misery",
  "misfortune",
  "mislead",
  "miss",
  "Miss",
  "missile",
  "missing",
  "mission",
  "mist",
  "mistake",
  "mister",
  "mistress",
  "misunderstand",
  "mix",
  "mixture",
  "mob",
  "mobile",
  "model",
  "moderate",
  "modern",
  "modest",
  "modesty",
  "moist",
  "moisture",
  "moment",
  "Monday",
  "money",
  "monitor",
  "monk",
  "monkey",
  "monster",
  "month",
  "monthly",
  "monument",
  "mood",
  "moon",
  "moonlight",
  "mop",
  "moral",
  "more",
  "moreover",
  "morning",
  "mortgage",
  "mosquito",
  "most",
  "motel",
  "moth",
  "mother",
  "Mother's Day",
  "motion",
  "motivate",
  "motivation",
  "motor",
  "motorcycle",
  "mountain",
  "mountainous",
  "mouse",
  "moustache",
  "mouth",
  "movable",
  "move",
  "movement",
  "movie",
  "mow",
  "Mr.",
  "Mrs.",
  "MRT",
  "Ms.",
  "much",
  "mud",
  "muddy",
  "mug",
  "multiple",
  "multiply",
  "murder",
  "murderer",
  "murmur",
  "muscle",
  "museum",
  "mushroom",
  "music",
  "musical",
  "musician",
  "must",
  "mutual",
  "my",
  "myself",
  "mysterious",
  "mystery",
  "nail",
  "naked",
  "name",
  "namely",
  "nap",
  "napkin",
  "narrow",
  "nasty",
  "nation",
  "national",
  "nationality",
  "native",
  "natural",
  "naturalist",
  "nature",
  "naughty",
  "naval",
  "navy",
  "near",
  "nearby",
  "nearly",
  "neat",
  "necessarily",
  "necessary",
  "necessity",
  "neck",
  "necklace",
  "need",
  "needle",
  "needy",
  "negative",
  "neglect",
  "negotiate",
  "negotiation",
  "neighbor",
  "neighborhood",
  "neither",
  "nephew",
  "nerve",
  "nervous",
  "nest",
  "net",
  "network",
  "never",
  "nevertheless",
  "new",
  "New Year's Day",
  "New Year's Eve",
  "newcomer",
  "news",
  "newscaster",
  "newspaper",
  "next",
  "nice",
  "nice-looking",
  "nickname",
  "niece",
  "night",
  "nightmare",
  "nine",
  "nineteen",
  "ninety",
  "no",
  "noble",
  "nobody",
  "nod",
  "noise",
  "noisy",
  "none",
  "nonetheless",
  "nonsense",
  "nonstop",
  "noodle",
  "noon",
  "nor",
  "normal",
  "north",
  "northeast",
  "northern",
  "northwest",
  "nose",
  "not",
  "note",
  "notebook",
  "nothing",
  "notice",
  "noun",
  "nourish",
  "novel",
  "novelist",
  "November",
  "now",
  "nowadays",
  "nowhere",
  "nuclear",
  "number",
  "numerous",
  "nun",
  "nurse",
  "nursery",
  "nursing",
  "nut",
  "nutrient",
  "nutrition",
  "nylon",
  "oak",
  "obedient",
  "obey",
  "object",
  "objection",
  "objective",
  "observation",
  "observe",
  "obstacle",
  "obtain",
  "obvious",
  "occasion",
  "occasional",
  "occupation",
  "occupy",
  "occur",
  "ocean",
  "o'clock",
  "October",
  "odd",
  "of",
  "off",
  "offend",
  "offense",
  "offensive",
  "offer",
  "office",
  "officer",
  "official",
  "often",
  "oh",
  "oil",
  "OK",
  "old",
  "Olympic",
  "omit",
  "on",
  "once",
  "one",
  "oneself",
  "one-sided",
  "onion",
  "online",
  "only",
  "onto",
  "open",
  "opener",
  "opening",
  "opera",
  "operate",
  "operation",
  "operator",
  "opinion",
  "opponent",
  "opportunity",
  "oppose",
  "opposite",
  "opposition",
  "optimistic",
  "option",
  "or",
  "oral",
  "orange",
  "orbit",
  "orchestra",
  "order",
  "orderly",
  "ordinary",
  "organ",
  "organic",
  "organization",
  "organize",
  "origin",
  "original",
  "orphan",
  "orphanage",
  "other",
  "otherwise",
  "ought",
  "ounce",
  "our",
  "ours",
  "ourselves",
  "out",
  "outcome",
  "outdoor",
  "outdoors",
  "outer",
  "outline",
  "output",
  "outside",
  "outstanding",
  "outward",
  "oval",
  "oven",
  "over",
  "overall",
  "overcoat",
  "overcome",
  "overflow",
  "overhead",
  "overlook",
  "overnight",
  "overpass",
  "overseas",
  "overtake",
  "overthrow",
  "overweight",
  "owe",
  "owl",
  "own",
  "owner",
  "ownership",
  "ox",
  "oxygen",
  "P.M.",
  "pace",
  "Pacific",
  "pack",
  "package",
  "packet",
  "pad",
  "page",
  "pain",
  "painful",
  "paint",
  "painter",
  "painting",
  "pair",
  "pajamas",
  "pal",
  "palace",
  "pale",
  "palm",
  "pan",
  "pancake",
  "panda",
  "panel",
  "panic",
  "pants",
  "papaya",
  "paper",
  "parachute",
  "parade",
  "paradise",
  "paragraph",
  "parallel",
  "parcel",
  "pardon",
  "parent",
  "park",
  "parking lot",
  "parliament",
  "parrot",
  "part",
  "partial",
  "participant",
  "participate",
  "participle",
  "particular",
  "particularly",
  "partner",
  "partnership",
  "part-time",
  "party",
  "pass",
  "passage",
  "passenger",
  "passion",
  "passive",
  "passport",
  "past",
  "pasta",
  "paste",
  "pat",
  "path",
  "patience",
  "patient",
  "patriotic",
  "pattern",
  "pause",
  "pave",
  "paw",
  "pay",
  "payment",
  "PE",
  "pea",
  "peace",
  "peaceful",
  "peach",
  "peak",
  "peanut",
  "pear",
  "pearl",
  "peasant",
  "pebble",
  "peculiar",
  "pedal",
  "peel",
  "peep",
  "peer",
  "pen",
  "penalty",
  "pencil",
  "penguin",
  "penny",
  "people",
  "pepper",
  "per",
  "percent",
  "percentage",
  "perfect",
  "perfection",
  "perform",
  "performance",
  "performer",
  "perfume",
  "perhaps",
  "period",
  "permanent",
  "permission",
  "permit",
  "persist",
  "person",
  "personal",
  "personality",
  "persuade",
  "persuasion",
  "persuasive",
  "pessimistic",
  "pest",
  "pet",
  "petal",
  "petrol",
  "phenomenon",
  "Philippines",
  "philosopher",
  "philosophical",
  "philosophy",
  "phone",
  "photo",
  "photograph",
  "photographer",
  "photographic",
  "photography",
  "phrase",
  "physical",
  "physician",
  "physicist",
  "physics",
  "pianist",
  "piano",
  "pick",
  "picnic",
  "picture",
  "pie",
  "piece",
  "pig",
  "pigeon",
  "pile",
  "pilgrim",
  "pill",
  "pillow",
  "pilot",
  "pin",
  "pine",
  "pineapple",
  "pink",
  "pint",
  "pioneer",
  "pipe",
  "pirate",
  "pit",
  "pitch",
  "pity",
  "pizza",
  "place",
  "plain",
  "plan",
  "plane",
  "planet",
  "plant",
  "plastic",
  "plate",
  "platform",
  "play",
  "player",
  "playground",
  "pleasant",
  "please",
  "pleased",
  "pleasure",
  "plentiful",
  "plenty",
  "plot",
  "plug",
  "plum",
  "plumber",
  "plural",
  "plus",
  "pocket",
  "poem",
  "poet",
  "poetry",
  "point",
  "poison",
  "poisonous",
  "pole",
  "police",
  "policeman",
  "policewoman",
  "policy",
  "polish",
  "polite",
  "political",
  "politician",
  "politics",
  "poll",
  "pollute",
  "pollution",
  "pond",
  "pony",
  "pool",
  "poor",
  "pop",
  "pop music",
  "popcorn",
  "popular",
  "population",
  "pork",
  "port",
  "portable",
  "porter",
  "portion",
  "portrait",
  "portray",
  "pose",
  "position",
  "positive",
  "possess",
  "possession",
  "possibility",
  "possible",
  "post",
  "post office",
  "postage",
  "postal",
  "postcard",
  "poster",
  "postpone",
  "pot",
  "potato",
  "potential",
  "pottery",
  "poultry",
  "pound",
  "pour",
  "poverty",
  "powder",
  "power",
  "powerful",
  "powerless",
  "practical",
  "practice",
  "praise",
  "pray",
  "prayer",
  "precious",
  "precise",
  "predict",
  "prediction",
  "prefer",
  "preferable",
  "pregnancy",
  "pregnant",
  "preparation",
  "prepare",
  "presence",
  "present",
  "presentation",
  "presently",
  "preserve",
  "president",
  "presidential",
  "press",
  "pressure",
  "pretend",
  "pretty",
  "prevent",
  "prevention",
  "preview",
  "previous",
  "price",
  "pride",
  "priest",
  "primary",
  "prime",
  "primitive",
  "prince",
  "princess",
  "principal",
  "principle",
  "print",
  "printer",
  "prison",
  "prisoner",
  "privacy",
  "private",
  "privilege",
  "prize",
  "probable",
  "probably",
  "problem",
  "procedure",
  "proceed",
  "process",
  "produce",
  "producer",
  "product",
  "production",
  "productive",
  "profession",
  "professional",
  "professor",
  "profit",
  "profitable",
  "program",
  "progress",
  "progressive",
  "prohibit",
  "project",
  "prominent",
  "promise",
  "promising",
  "promote",
  "promotion",
  "prompt",
  "pronounce",
  "pronunciation",
  "proof",
  "proper",
  "property",
  "proportion",
  "proposal",
  "propose",
  "prospect",
  "prosper",
  "prosperity",
  "prosperous",
  "protect",
  "protection",
  "protective",
  "protein",
  "protest",
  "proud",
  "prove",
  "proverb",
  "provide",
  "province",
  "psychological",
  "psychologist",
  "psychology",
  "pub",
  "public",
  "publication",
  "publicity",
  "publish",
  "publisher",
  "pudding",
  "pull",
  "pump",
  "pumpkin",
  "punch",
  "punctual",
  "punish",
  "punishment",
  "pupil",
  "puppet",
  "puppy",
  "purchase",
  "pure",
  "purple",
  "purpose",
  "purse",
  "pursue",
  "pursuit",
  "push",
  "put",
  "puzzle",
  "qualification",
  "qualified",
  "qualify",
  "quality",
  "quantity",
  "quarrel",
  "quarter",
  "queen",
  "question",
  "queue",
  "quick",
  "quiet",
  "quilt",
  "quit",
  "quite",
  "quiz",
  "quote",
  "rabbit",
  "race",
  "racial",
  "radar",
  "radiation",
  "radical",
  "radio",
  "rage",
  "railroad",
  "rain",
  "rainbow",
  "raincoat",
  "rainfall",
  "rainy",
  "raise",
  "raisin",
  "range",
  "rank",
  "rapid",
  "rare",
  "rarely",
  "rat",
  "rate",
  "rather",
  "raw",
  "ray",
  "razor",
  "reach",
  "react",
  "reaction",
  "read",
  "reader",
  "readily",
  "reading",
  "ready",
  "real",
  "realistic",
  "reality",
  "realize",
  "really",
  "rear",
  "reason",
  "reasonable",
  "rebel",
  "rebuild",
  "recall",
  "receipt",
  "receive",
  "receiver",
  "recent",
  "reception",
  "recession",
  "recipe",
  "recite",
  "recognition",
  "recognize",
  "recommend",
  "record",
  "recorder",
  "recover",
  "recovery",
  "recreation",
  "rectangle",
  "recycle",
  "red",
  "reduce",
  "reduction",
  "refer",
  "reference",
  "reflect",
  "reflection",
  "reform",
  "refresh",
  "refrigerator",
  "refugee",
  "refusal",
  "refuse",
  "regard",
  "regarding",
  "regardless",
  "region",
  "regional",
  "register",
  "registration",
  "regret",
  "regular",
  "regulate",
  "regulation",
  "rehearsal",
  "rehearse",
  "reject",
  "relate",
  "related",
  "relation",
  "relationship",
  "relative",
  "relatively",
  "relax",
  "relaxation",
  "release",
  "reliable",
  "relief",
  "relieve",
  "religion",
  "religious",
  "reluctant",
  "rely",
  "remain",
  "remark",
  "remarkable",
  "remedy",
  "remember",
  "remind",
  "reminder",
  "remote",
  "remove",
  "renew",
  "rent",
  "repair",
  "repeat",
  "repeatedly",
  "repetition",
  "replace",
  "reply",
  "report",
  "reporter",
  "represent",
  "representation",
  "representative",
  "republic",
  "Republic of China",
  "republican",
  "reputation",
  "request",
  "require",
  "requirement",
  "rescue",
  "research",
  "researcher",
  "resemble",
  "reservation",
  "reserve",
  "residence",
  "resident",
  "resign",
  "resignation",
  "resist",
  "resistance",
  "resistant",
  "resolution",
  "resolve",
  "resource",
  "respect",
  "respond",
  "response",
  "responsibility",
  "responsible",
  "rest",
  "restaurant",
  "restless",
  "restore",
  "restrict",
  "restriction",
  "restroom",
  "result",
  "retain",
  "retire",
  "retreat",
  "return",
  "reunite",
  "reveal",
  "revenge",
  "review",
  "revise",
  "revision",
  "revolution",
  "revolutionary",
  "reward",
  "rewrite",
  "rhyme",
  "rhythm",
  "ribbon",
  "rice",
  "rich",
  "riches",
  "rid",
  "riddle",
  "ride",
  "rider",
  "ridiculous",
  "rifle",
  "right",
  "right-hand",
  "ring",
  "ripe",
  "rise",
  "risk",
  "rival",
  "river",
  "road",
  "roar",
  "roast",
  "rob",
  "robber",
  "robbery",
  "robe",
  "robot",
  "rock",
  "rocket",
  "rod",
  "role",
  "roll",
  "roller blade",
  "roller skate",
  "romance",
  "romantic",
  "roof",
  "room",
  "rooster",
  "root",
  "rope",
  "rose",
  "rot",
  "rotten",
  "rough",
  "roughly",
  "round",
  "route",
  "routine",
  "row",
  "royal",
  "rub",
  "rubber",
  "rubbish",
  "rude",
  "rug",
  "ruin",
  "rule",
  "ruler",
  "rumor",
  "run",
  "runner",
  "running",
  "rural",
  "rush",
  "Russia",
  "rust",
  "rusty",
  "sack",
  "sacrifice",
  "sad",
  "sadden",
  "safe",
  "safety",
  "sail",
  "sailor",
  "sake",
  "salad",
  "salary",
  "sale",
  "salesperson",
  "salt",
  "salty",
  "same",
  "sample",
  "sanction",
  "sand",
  "sandwich",
  "satellite",
  "satisfaction",
  "satisfactory",
  "satisfy",
  "Saturday",
  "sauce",
  "saucer",
  "sausage",
  "save",
  "saving",
  "saw",
  "say",
  "saying",
  "scale",
  "scan",
  "scarce",
  "scarcely",
  "scare",
  "scarf",
  "scary",
  "scatter",
  "scene",
  "scenery",
  "schedule",
  "scheme",
  "scholar",
  "scholarship",
  "school",
  "schoolmate",
  "science",
  "scientific",
  "scientist",
  "scissors",
  "scold",
  "scoop",
  "scooter",
  "score",
  "scout",
  "scratch",
  "scream",
  "screen",
  "screw",
  "scrub",
  "sculpture",
  "sea",
  "seafood",
  "seagull",
  "seal",
  "search",
  "seaside",
  "season",
  "seat",
  "second",
  "secondary",
  "second-hand",
  "secret",
  "secretary",
  "section",
  "sector",
  "secure",
  "security",
  "see",
  "seed",
  "seek",
  "seem",
  "seesaw",
  "seize",
  "seldom",
  "select",
  "selection",
  "self",
  "selfish",
  "sell",
  "semester",
  "send",
  "senior",
  "senior high school",
  "sense",
  "sensible",
  "sensitive",
  "sentence",
  "separate",
  "separation",
  "September",
  "series",
  "serious",
  "servant",
  "serve",
  "service",
  "session",
  "set",
  "settle",
  "settlement",
  "settler",
  "setup",
  "seven",
  "seventeen",
  "seventy",
  "several",
  "severe",
  "sew",
  "sex",
  "sexual",
  "sexy",
  "shade",
  "shadow",
  "shady",
  "shake",
  "shall",
  "shallow",
  "shame",
  "shameful",
  "shampoo",
  "shape",
  "share",
  "shark",
  "sharp",
  "sharpen",
  "shave",
  "shaver",
  "she",
  "sheep",
  "sheet",
  "shelf",
  "shell",
  "shelter",
  "shepherd",
  "shift",
  "shine",
  "shining",
  "shiny",
  "ship",
  "shirt",
  "shock",
  "shoe",
  "shoot",
  "shop",
  "shopkeeper",
  "shore",
  "short",
  "shortage",
  "shortcoming",
  "shortcut",
  "shorten",
  "shortly",
  "shorts",
  "short-sighted",
  "short-term",
  "shot",
  "should",
  "shoulder",
  "shout",
  "shovel",
  "show",
  "shower",
  "shrimp",
  "shrink",
  "shrug",
  "shut",
  "shuttle",
  "shy",
  "sick",
  "sickness",
  "side",
  "sidewalk",
  "sigh",
  "sight",
  "sightseeing",
  "sign",
  "signal",
  "signature",
  "significance",
  "significant",
  "silence",
  "silent",
  "silk",
  "silly",
  "silver",
  "similar",
  "similarity",
  "simple",
  "simplify",
  "simply",
  "sin",
  "since",
  "sincere",
  "sing",
  "Singapore",
  "singer",
  "single",
  "singular",
  "sink",
  "sip",
  "sir",
  "sister",
  "sit",
  "site",
  "situation",
  "six",
  "sixteen",
  "sixty",
  "size",
  "skate",
  "sketch",
  "ski",
  "skill",
  "skillful",
  "skim",
  "skin",
  "skinny",
  "skip",
  "skirt",
  "sky",
  "skyscraper",
  "slang",
  "slave",
  "slavery",
  "sleep",
  "sleepy",
  "sleeve",
  "slender",
  "slice",
  "slide",
  "slight",
  "slim",
  "slip",
  "slipper",
  "slippery",
  "slogan",
  "slope",
  "slow",
  "small",
  "smart",
  "smell",
  "smile",
  "smog",
  "smoke",
  "smoky",
  "smooth",
  "snack",
  "snail",
  "snake",
  "snap",
  "sneak",
  "sneaker",
  "sneaky",
  "sneeze",
  "snow",
  "snowman",
  "snowy",
  "so",
  "soap",
  "sob",
  "soccer",
  "sociable",
  "social",
  "society",
  "socket",
  "sock",
  "soda",
  "sofa",
  "soft",
  "soft drink",
  "softball",
  "software",
  "soil",
  "solar",
  "soldier",
  "solid",
  "solution",
  "solve",
  "some",
  "somebody",
  "somehow",
  "someone",
  "something",
  "sometime",
  "sometimes",
  "somewhat",
  "somewhere",
  "son",
  "song",
  "soon",
  "sore",
  "sorrow",
  "sorry",
  "sort",
  "soul",
  "sound",
  "soup",
  "sour",
  "source",
  "south",
  "south-east",
  "southern",
  "south-west",
  "souvenir",
  "sow",
  "soy sauce",
  "soybean",
  "space",
  "spacecraft",
  "spade",
  "spaghetti",
  "spare",
  "spark",
  "sparkle",
  "sparrow",
  "speak",
  "speaker",
  "spear",
  "special",
  "specialized",
